# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

sum = int(input('Введите сумму сделанных журавликов, кратную 6: '))
while sum % 6 != 0:
    sum = int(input('Введены не корректные данные.'))
else:
    print((sum // 6), (( sum // 6) * 4), (sum // 6))
